In [17]:
import sqlite3
from sqlite3 import Error
import os

def create_connection(db_file):
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)

    return conn


def create_table(conn, create_table_sql):
    try:
        c = conn.cursor()
        c.execute(create_table_sql)
    except Error as e:
        print(e)

db = 'depts_students.db'
if os.path.exists(db):
    os.remove(db)

create_table_departments_sql = """ CREATE TABLE Departments (
    DepartmentId INTEGER NOT NULL PRIMARY KEY,
    DepartmentName TEXT 
); """

create_table_students_sql = """CREATE TABLE [Students] (
    [StudentId] INTEGER PRIMARY KEY NOT NULL,
    [StudentName] TEXT NOT NULL,
    [DepartmentId] INTEGER,
    [DateOfBirth] DATE,
    FOREIGN KEY(DepartmentId) REFERENCES Departments(DepartmentId)
);"""

depts = ('IT', 'Physics', 'Arts', 'Math')

students = (
    ('Michael', 1, '1998-10-12'),
    ('John', 1, '1998-10-12'),
    ('Jack', 1, '1998-10-12'),
    ('Sara', 2, '1998-10-12'),
    ('Sally', 2, '1998-10-12'),
    ('Jena', None, '1998-10-12'),
    ('Nancy', 2, '1998-10-12'),
    ('Adam', 3, '1998-10-12'),
    ('Stevens', 3, '1998-10-12'),
    ('George', None, '1998-10-12')
)

def insert_depts(conn, values):
    sql = ''' INSERT INTO Departments(DepartmentName)
              VALUES(?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid

def insert_student(conn, values):
    sql = ''' INSERT INTO Students(StudentName, DepartmentId, DateOfBirth)
              VALUES(?,?,?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid


conn = create_connection(db)

with conn:
    create_table(conn, create_table_departments_sql)
    create_table(conn, create_table_students_sql)
    for values in depts:
        insert_depts(conn, (values, )) # artifical tuple
        
    for values in students:
        insert_student(conn, values)

PermissionError: [WinError 32] The process cannot access the file because it is being used by another process: 'depts_students.db'

In [3]:
import sqlite3
from sqlite3 import Error
import os
def create_connection(db_file):
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)

    return conn
db = 'depts_students.db'
conn = create_connection(db)

import pandas as pd
pd.read_sql_query('SELECT * FROM Departments', conn)

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [18]:
x = '"Chemistry"); DROP TABLE Students;'
sql_statement = f'INSERT INTO Departments(DepartmentName) VALUES({x})'
print(sql_statement)

INSERT INTO Departments(DepartmentName) VALUES("Chemistry"); DROP TABLE Students;)

In [19]:
print(sql_statement)
cur = conn.cursor()
row_id = cur.execute(sql_statement)

INSERT INTO Departments(DepartmentName) VALUES("Chemistry"); DROP TABLE Students;)

Warning: You can only execute one statement at a time.

In [4]:
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
for row in cur.fetchall():  
    print(row)

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')

In [23]:
cur = conn.cursor()
sql = ''' INSERT INTO Departments(DepartmentName)
              VALUES(?) '''
values = ('"Biology"); DROP TABLE Students;)', )
cur.execute(sql, values)

In [5]:
cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
for row in cur.fetchall():  
    print(row)

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')

In [6]:
for row in cur.fetchall():
    print(row)

In [7]:
cur.execute('SELECT * FROM Departments')
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')
None

In [9]:
cur.execute('SELECT * FROM Departments')
value = cur.fetchone()
while value:
    print(value)
    value = cur.fetchone()

(1, 'IT')
(2, 'Physics')
(3, 'Arts')
(4, 'Math')

In [10]:
cur.execute('SELECT * FROM Departments')
dept_fk_lookup = {}
for key, text in cur.fetchall():
    dept_fk_lookup[text] = key
print(dept_fk_lookup)

{'IT': 1, 'Physics': 2, 'Arts': 3, 'Math': 4}

In [15]:
cur.execute('SELECT DepartmentName FROM Departments')
dept_fk_lookup = {}
for row in cur.fetchall():
    print(row)
    print(row[0])

('IT',)
IT
('Physics',)
Physics
('Arts',)
Arts
('Math',)
Math

In [27]:
def insert_depts(conn, values):
    sql = ''' INSERT INTO Departments(DepartmentName)
              VALUES(?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid

def insert_student(conn, values):
    sql = ''' INSERT INTO Students(StudentName, DepartmentId, DateOfBirth)
              VALUES(?,?,?) '''
    cur = conn.cursor()
    cur.execute(sql, values)
    return cur.lastrowid
    
db = 'depts_students_new2.db'
conn = create_connection(db)

create_table_departments_sql = """ CREATE TABLE [Departments] (
    [DepartmentId] INTEGER  NOT NULL PRIMARY KEY,
    [DepartmentName] TEXT 
); """

create_table_students_sql = """CREATE TABLE [Students] (
    [StudentId] INTEGER  PRIMARY KEY NOT NULL,
    [StudentName] TEXT NOT NULL,
    [DepartmentId] INTEGER,
    [DateOfBirth] DATE,
    FOREIGN KEY(DepartmentId) REFERENCES Departments(DepartmentId)
);"""

depts = sorted(('IT', 'Physics', 'Arts', 'Math'))
students = (
    ('Michael', 'IT', '1998-10-12'),
    ('John', 'IT', '1998-10-12'),
    ('Jack', 'IT', '1998-10-12'),
    ('Sara', 'Physics', '1998-10-12'),
    ('Sally', 'Physics', '1998-10-12'),
    ('Jena', None, '1998-10-12'),
    ('Nancy', 'Physics', '1998-10-12'),
    ('Adam', 'Arts', '1998-10-12'),
    ('Stevens', 'Arts', '1998-10-12'),
    ('George', None, '1998-10-12')
)


with conn:
    create_table(conn, create_table_departments_sql)
    for values in depts:
        insert_depts(conn, (values, ))

cur = conn.cursor()
cur.execute('SELECT * FROM Departments')
dept_fk_lookup = {}
for key, text in cur.fetchall():
    dept_fk_lookup[text] = key
print(dept_fk_lookup)


with conn:
    create_table(conn, create_table_students_sql)
    for values in students:
        values = list(values)
        print('BEFORE', values)
        key = values[1]
        print('key', key)
        if key:
            values[1] = dept_fk_lookup[values[1]]
        print('AFTER',values)
        insert_student(conn, values)

{'Arts': 1, 'IT': 2, 'Math': 3, 'Physics': 4}
BEFORE ['Michael', 'IT', '1998-10-12']
key IT
AFTER ['Michael', 2, '1998-10-12']
BEFORE ['John', 'IT', '1998-10-12']
key IT
AFTER ['John', 2, '1998-10-12']
BEFORE ['Jack', 'IT', '1998-10-12']
key IT
AFTER ['Jack', 2, '1998-10-12']
BEFORE ['Sara', 'Physics', '1998-10-12']
key Physics
AFTER ['Sara', 4, '1998-10-12']
BEFORE ['Sally', 'Physics', '1998-10-12']
key Physics
AFTER ['Sally', 4, '1998-10-12']
BEFORE ['Jena', None, '1998-10-12']
key None
AFTER ['Jena', None, '1998-10-12']
BEFORE ['Nancy', 'Physics', '1998-10-12']
key Physics
AFTER ['Nancy', 4, '1998-10-12']
BEFORE ['Adam', 'Arts', '1998-10-12']
key Arts
AFTER ['Adam', 1, '1998-10-12']
BEFORE ['Stevens', 'Arts', '1998-10-12']
key Arts
AFTER ['Stevens', 1, '1998-10-12']
BEFORE ['George', None, '1998-10-12']
key None
AFTER ['George', None, '1998-10-12']

In [25]:
cur.execute('SELECT * FROM Departments')
print(cur.fetchall())

[(1, 'IT'), (2, 'Physics'), (3, 'Arts'), (4, 'Math'), (5, 'IT'), (6, 'Physics'), (7, 'Arts'), (8, 'Math'), (9, 'IT'), (10, 'Physics'), (11, 'Arts'), (12, 'Math')]

In [29]:
def execute_sql_statement(sql_statement, conn):
    cur = conn.cursor()
    cur.execute(sql_statement)

    rows = cur.fetchall()

    return rows
conn = create_connection('india_export.db')
sql_statement = "SELECT DISTINCT year from export ORDER BY year"
years = execute_sql_statement(sql_statement, conn)
years = list(map(lambda row: int(row[0]), years))
print(years)

[2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018]